app/Http/Controllers/Auth/LoginController.php

    public function login( Request $request)
    {
        $mail_id = $request['userName'];
        $pwd = $request['userPwd'];
        $password = openssl_digest($pwd, 'sha512');
        $user = UserProfile::where([['user_login_id','=',$mail_id],['is_deleted', '=', 0],['is_active', '=' ,1]])
                            ->where('user_login_password','=',$password)
                            ->select('user_profile_id','user_login_id','user_id','user_type','clnt_id','clnt_group_id')
                            ->first();


         if ($user === null || empty($user)) {


            return false;
           }else{

            $request->session()->put('user', $user);
            $value = $request->session()->get('user');

            $request->session()->put('user_login_id', $value->user_login_id);
            Cookie::queue("user_profile_id", $value->user_login_id, 259200);


            $one['login_ip_address'] = $_SERVER['REMOTE_ADDR'];
            $one['user_profile_id'] = $value->user_profile_id;
            $login = new  UserAccess;
            $login->fill($one);
            $login->save();

            $user['user_access_log_id']= $login->user_access_log_id;

            $sql = DB::table("bl_order_master")
                    ->where('user_profile_id','=',$value->user_profile_id)
                    ->get();

            $sql1 = DB::table("bl_shopping_cart_master as shopMaster")
                    ->join('bl_shopping_cart_detail as shopDetail', 'shopDetail.shopping_cart_master_id', '=', 'shopMaster.id')
                    ->select('shopMaster.user_profile_id','shopDetail.shopping_cart_master_id')
                    ->get();

            $empsql = DB::table("bl_promo_master as pm")
                        ->where('pm.exam_allocated_to','=',$value->user_profile_id)
                        ->whereRaw("pm.allocated_flag = true   and CURDATE() >= pm.promo_valid_fm_date and CURDATE() < promo_valid_to_date ")
                        ->select('pm.exam_allocated_to', 'pm.id')
                        ->get();
---
insert into `bl_user_access_log` (`login_ip_address`, `user_profile_id`) values ('127.0.0.1', '47')
select * from `bl_order_master` where `user_profile_id` = '47'
select `shopMaster`.`user_profile_id`, `shopDetail`.`shopping_cart_master_id` from `bl_shopping_cart_master` as `shopMaster` inner join `bl_shopping_cart_detail` as `shopDetail` on `shopDetail`.`shopping_cart_master_id` = `shopMaster`.`id`
select `pm`.`exam_allocated_to`, `pm`.`id` from `bl_promo_master` as `pm` where `pm`.`exam_allocated_to` = '47' and pm.allocated_flag = true   and CURDATE() >= pm.promo_valid_fm_date and CURDATE() < promo_valid_to_date


            else if(($value->user_type == 'T')) {
                 Session::put('user_type', $value->user_type);
                 $tmp = DB::table('bl_client')
                  ->where('client_id', '=',$value->user_id )
                  ->select('clnt_contact_person_first_name','clnt_contact_person_last_name')
                                ->get();
---
select `clnt_contact_person_first_name`, `clnt_contact_person_last_name` from `bl_client` where `client_id` = '7'


            elseif ($value->user_type == 'C') {
              Session::put('user_type', $value->user_type);
              $tmp = DB::table('bl_customer')
                  ->where('customer_id', '=',$value->user_id )
                  ->select('cust_first_name','cust_last_name')
                                ->get();
---
select `cust_first_name`, `cust_last_name` from `bl_customer` where `customer_id` = '1'

   public static function Session_cookie($values,$request){
    $user = UserProfile::where([['user_login_id','=',$values],['is_deleted', '=', 0]])
                            ->select('user_profile_id','user_login_id','user_id','user_type','clnt_id','clnt_group_id')
                            ->first();
    $request->session()->put('user', $user);
    $value = $request->session()->get('user');
    $request->session()->put('user_login_id', $value->user_login_id);
    $one['login_ip_address'] = $_SERVER['REMOTE_ADDR'];
    $one['user_profile_id'] = $value->user_profile_id;
    $login = new  UserAccess;
    $login->fill($one);
    $login->save();
---
insert into `bl_user_access_log` (`login_ip_address`, `user_profile_id`) values ('127.0.0.1', '47')

      }
      elseif ($value->user_type == 'C') {
        Session::put('user_type', $value->user_type);
        $tmp = DB::table('bl_customer')
            ->where('customer_id', '=',$value->user_id )
            ->select('cust_first_name','cust_last_name')
                          ->get();
---
select `cust_first_name`, `cust_last_name` from `bl_customer` where `customer_id` = '1'

      }
      else if($value->user_type == 'E'){
          Session::put('user_type', $value->user_type);
          $tmp = DB::table('bl_employee')
            ->where('emp_employee_id', '=',$value->user_id )
            ->select('emp_first_name','emp_last_name')
            ->get();
---
select `emp_first_name`, `emp_last_name` from `bl_employee` where `emp_employee_id` = '2'