app/Repositories/ClientRepository.php

select count(*) as aggregate from `bl_client`
---
    public function getEnroll(){

     try{
            $client = DB::table('bl_client')
            ->count();