app/Repositories/CustomersRepository.php

    public function getCount(){

     try{
            $customers = DB::table('bl_customer')
            ->count();
---
select count(*) as aggregate from `bl_customer`