app/Repositories/ProductCatalogRepository.php

    public function selectId($user_id,$user_type){
        try{
          if($user_type == 'S'){
            $product = DB::table("bl_product_catalog as proc")->where('proc.is_deleted',0)
            ->where(function($q) {
                    $currentdate =new Carbon();
                    $q->where('proc.valid_from', '<=' , $currentdate)
                    ->orWhere('proc.valid_to', '>=' , $currentdate);
              })
            ->get();

          }else{
            $product = DB::table("bl_product_catalog as proc")->where([['proc.is_deleted',0],['proc.clnt_id','=',$user_id]])
            ->where(function($q) {
                    $currentdate =new Carbon();
                    $q->where('proc.valid_from', '<=' , $currentdate)
                    ->orWhere('proc.valid_to', '>=' , $currentdate);
              })
            ->get();
---
select * from `bl_product_catalog` as `proc` where (`proc`.`is_deleted` = '0' and `proc`.`clnt_id` = '7') and (`proc`.`valid_from` <= '2018-05-24 10:50:53' or `proc`.`valid_to` >= '2018-05-24 10:50:53')

    public function selectUserProduct(){
        try{
            $product = DB::table("bl_product_catalog as proc")
                        ->join('bl_category as cat','proc.category_id','=','cat.category_id')
                        ->join('bl_subject as sub','proc.subject_id','=','sub.subject_id')
                        ->join('bl_topic as top','proc.topic_id','=','top.topic_id')
                        ->where([['proc.is_deleted',0],['proc.is_active',1],['proc.populate_all','=',1]])
                  ->where(function($q) {
                          $currentdate =new Carbon();
                          $q->where('proc.valid_from', '<=' , $currentdate)
                          ->orWhere('proc.valid_to', '>=' , $currentdate);
                    })
                    ->select('top.topic_name','sub.subject_name','cat.category_name','proc.name','proc.description','proc.id','proc.price','top.topic_id','cat.category_id','sub.subject_id')
                    ->get();
---
select `top`.`topic_name`, `sub`.`subject_name`, `cat`.`category_name`, `proc`.`name`, `proc`.`description`, `proc`.`id`, `proc`.`price`, `top`.`topic_id`, `cat`.`category_id`, `sub`.`subject_id` from `bl_product_catalog` as `proc` inner join `bl_category` as `cat` on `proc`.`category_id` = `cat`.`category_id` inner join `bl_subject` as `sub` on `proc`.`subject_id` = `sub`.`subject_id` inner join `bl_topic` as `top` on `proc`.`topic_id` = `top`.`topic_id` where (`proc`.`is_deleted` = '0' and `proc`.`is_active` = '1' and `proc`.`populate_all` = '1') and (`proc`.`valid_from` <= '2018-05-24 10:20:33' or `proc`.`valid_to` >= '2018-05-24 10:20:33')