app/Repositories/ShoppingCartRepository.php

    public function getAllProduct($user_id){
        try{

                // $sql = 'proc.valid_from' >= $currentdate or 'proc.valid_to' >= $currentdate;

              $product = DB::table("bl_product_catalog as proc")

                ->where(function($q) use ($user_id){
                    $currentdate =new Carbon();
                    // $q->where('proc.valid_from', '<=' , $currentdate)
                    // ->orWhere('proc.valid_to', '>=' , $currentdate)
                    $q->where([['proc.is_deleted',0],['proc.is_active',1],['proc.valid_from', '<=' , $currentdate],['proc.valid_to', '>=' , $currentdate]])
                ->orWhere([['proc.populate_all',1],['proc.is_deleted',0],['proc.is_active',1],['proc.clnt_id','=',$user_id],['proc.valid_from', '<=' , $currentdate],['proc.valid_to', '>=' , $currentdate]]);
              })
                //->orWhere('proc.valid_to', '>=' , $currentdate)
                ->join('bl_category as cat','proc.category_id','=','cat.category_id')
                ->join('bl_subject as sub','proc.subject_id','=','sub.subject_id')
                ->join('bl_topic as top','proc.topic_id','=','top.topic_id')
                // ->join('bl_product_catalog_attempt_type_link as prod_link','prod_link.product_catalog_id','=','proc.id')
                ->join('bl_exam_attempt_type as exam','exam.id', '=', 'proc.exam_attempt_type_id')
                ->select('proc.*','cat.category_name','cat.category_id','sub.subject_id','top.topic_id','sub.subject_name','top.topic_name','exam.name as examName')
                ->simplePaginate(self::$RECORDS_PER_PAGE);
---
select `proc`.*, `cat`.`category_name`, `cat`.`category_id`, `sub`.`subject_id`, `top`.`topic_id`, `sub`.`subject_name`, `top`.`topic_name`, `exam`.`name` as `examName` from `bl_product_catalog` as `proc` inner join `bl_category` as `cat` on `proc`.`category_id` = `cat`.`category_id` inner join `bl_subject` as `sub` on `proc`.`subject_id` = `sub`.`subject_id` inner join `bl_topic` as `top` on `proc`.`topic_id` = `top`.`topic_id` inner join `bl_exam_attempt_type` as `exam` on `exam`.`id` = `proc`.`exam_attempt_type_id` where ((`proc`.`is_deleted` = '0' and `proc`.`is_active` = '1' and `proc`.`valid_from` <= '2018-05-24 12:19:32' and `proc`.`valid_to` >= '2018-05-24 12:19:32') or (`proc`.`populate_all` = '1' and `proc`.`is_deleted` = '0' and `proc`.`is_active` = '1' and `proc`.`clnt_id` = '1' and `proc`.`valid_from` <= '2018-05-24 12:19:32' and `proc`.`valid_to` >= '2018-05-24 12:19:32')) limit 6 offset 0

     public function addShoppingCart(array $data, $user_profile_id)
    {
         try {
            DB::beginTransaction();
            $shoppingMasterId = $data[0]['shopping_cart_master_id'];

            if($shoppingMasterId == 0){
                $test = DB::table('bl_shopping_cart_detail')
                                ->where('product_catalog_id', '=', $data[0]['product_catalog_id'])
                                ->join('bl_shopping_cart_master as shopM','shopM.id','=','shopping_cart_master_id')
                                ->select('shopping_cart_master_id')
                                ->get();
---
select `shopping_cart_master_id` from `bl_shopping_cart_detail` inner join `bl_shopping_cart_master` as `shopM` on `shopM`.`id` = `shopping_cart_master_id` where `product_catalog_id` = '4'

                    $shoppingCartMaster['gateway_param'] = '1';
                    $shoppingCartMaster['user_profile_id'] = $user_profile_id;
                    $shoppingCartMaster->fill($data[0]);
                    $shoppingCartMaster->save();
---
insert into `bl_shopping_cart_master` (`last_update_user_id`, `shopping_code`, `created_by_user_id`, `tax_ref_no`, `total`, `currency_id`, `total_tax`, `gateway_param`, `user_profile_id`, `clnt_id`, `clnt_group_id`) values ('47', 'BLSHP20180524174934', '47', '1', '1', '1', '87.30', '1', '47', '47', '1')


                      $shoppingCartMasterId = $shoppingCartMaster->id;
                     // Model::insert($data); // Eloquent approach
                      DB::table('bl_shopping_cart_detail')->insert($data); // Query Builder approach
---
insert into `bl_shopping_cart_detail` (`bundle_price`, `cgst`, `clnt_group_id`, `clnt_id`, `discount`, `grand_total`, `id`, `igst`, `order_seq`, `other_tax1`, `other_tax2`, `other_tax3`, `price`, `product_catalog_id`, `sgst`, `shopping_cart_date`, `shopping_cart_master_id`, `total_tax`, `user_profile_id`, `valid_from`, `valid_to`) values ('4.00', '5.00', '1', '47', '3.00', '', '4', '7.00', '1', '5.00', '5.00', '7.00', '250.00', '4', '7.00', '', '2', '87.30', '47', '2018-05-24 12:19:32', '2018-05-27 12:19:32')

    public function getAllPerforma($user_type, $user_id){
        try{

       if($user_type == 'C'){
                    $invoice = DB::table("bl_customer as cust")
                    ->join('bl_user_profile_defn as user','user.user_id','=','cust.customer_id')
                    ->join('bl_address as address','cust.customer_id','=','address.user_id')
                    ->join('bl_country_master as cou','cou.country_id','=','address.country_id')
                    ->where([['cust.is_deleted',0],['address.add_type_id',2],['user.user_type','C']])
                    ->where('cust.customer_id','=',$user_id)
                    ->select('cust.cust_first_name as consignee_first_name','cust.customer_id','address.cust_add_line_1 as consignee_add_line_1','cust.cust_pan as consignee_pan','cou.country_full_name')
                    ->get();
---
select `cust`.`cust_first_name` as `consignee_first_name`, `cust`.`customer_id`, `address`.`cust_add_line_1` as `consignee_add_line_1`, `cust`.`cust_pan` as `consignee_pan`, `cou`.`country_full_name` from `bl_customer` as `cust` inner join `bl_user_profile_defn` as `user` on `user`.`user_id` = `cust`.`customer_id` inner join `bl_address` as `address` on `cust`.`customer_id` = `address`.`user_id` inner join `bl_country_master` as `cou` on `cou`.`country_id` = `address`.`country_id` where (`cust`.`is_deleted` = '0' and `address`.`add_type_id` = '2' and `user`.`user_type` = 'C') and `cust`.`customer_id` = '1'

    public function getAllCart($user_profile_id){
        try{

                $product = DB::table('bl_user_profile_defn as user')
                    ->where('user.user_profile_id', '=', $user_profile_id)
                ->join('bl_shopping_cart_master as shopM','user.user_profile_id','=','shopM.user_profile_id')
                ->join('bl_shopping_cart_detail as shopD', 'shopD.shopping_cart_master_id', '=', 'shopM.id')
                ->join('bl_product_catalog as prd', 'shopD.product_catalog_id', '=', 'prd.id')
                ->select('prd.*','shopM.id as shopMId')
                ->get();
---
select `prd`.*, `shopM`.`id` as `shopMId` from `bl_user_profile_defn` as `user` inner join `bl_shopping_cart_master` as `shopM` on `user`.`user_profile_id` = `shopM`.`user_profile_id` inner join `bl_shopping_cart_detail` as `shopD` on `shopD`.`shopping_cart_master_id` = `shopM`.`id` inner join `bl_product_catalog` as `prd` on `shopD`.`product_catalog_id` = `prd`.`id` where `user`.`user_profile_id` = '47'

    public function confirmCartOrder(array $data, $user_profile_id, $user_id, $user_type,$clnt_group_id)
    {

         try {
            DB::beginTransaction();

                $orderMaster = new OrderMaster;
                if($user_type == 'C'){
                $orderMaster['order_no'] = BLAlphaNumericCodeGenerator::getCode(config('blconstants.order_code'));
                $orderMaster['tax_ref_no'] = '1';
                $orderMaster['total'] = '1';
                $orderMaster['total_tax'] = '1';
                $orderMaster['gateway_param'] = '1';
                $orderMaster['user_profile_id'] = $user_profile_id;
                $orderMaster['created_by_user_id'] = $user_profile_id;
                $orderMaster['last_update_user_id'] = $user_profile_id;
                $data[0]['clnt_group_id'] = NULL;
                $data[0]['clnt_id'] = NULL;
                $orderMaster->fill($data[0]);
                $orderMaster->save();
---
insert into `bl_order_master` (`order_no`, `tax_ref_no`, `total`, `total_tax`, `gateway_param`, `user_profile_id`, `created_by_user_id`, `last_update_user_id`, `clnt_id`, `clnt_group_id`, `currency_id`) values ('BLODR20180524180200', '1', '1', '1', '1', '47', '47', '47', '', '', '2')

                        $order_detail['no_of_attempts']=$data[$x]['quantity'];
                    }
                    $order_detail->fill($data);
                    $order_detail->save();

                $prodId = $order_detail->product_catalog_id;
                $data11 = DB::table('bl_shopping_cart_detail')->where([["product_catalog_id",'=', $prodId],['user_profile_id','=',$user_profile_id]])->select('shopping_cart_master_id')->get();
                $shopMaster = DB::table('bl_shopping_cart_master')->where("id",'=', $data11[0]->shopping_cart_master_id)->delete();
                $shopcart = DB::table('bl_shopping_cart_detail')->where([["product_catalog_id",'=', $prodId],['user_profile_id','=',$user_profile_id]])->delete();
---
insert into `bl_order_detail` (`user_profile_id`, `order_master_id`, `order_seq`, `product_catalog_id`, `price`, `discount`, `bundle_price`, `sgst`, `cgst`, `igst`, `other_tax1`, `other_tax2`, `other_tax3`, `total_tax`, `grand_total`, `clnt_id`, `clnt_group_id`, `valid_from`, `valid_to`, `unit_qty`, `no_of_attempts`) values ('47', '31', '1', '4', '250.00', '15.00', '4.00', '7.00', '5.00', '7.00', '5.00', '5.00', '7.00', '174.60', '659.60', '', '', '2018-05-24 12:31:58', '2018-05-27 12:31:58', '2', '99999999999')
select `shopping_cart_master_id` from `bl_shopping_cart_detail` where (`product_catalog_id` = '4' and `user_profile_id` = '47')
delete from `bl_shopping_cart_master` where `id` = '3'
delete from `bl_shopping_cart_detail` where (`product_catalog_id` = '4' and `user_profile_id` = '47')

        }

                if($user_type == 'C'){
                    $invoice = DB::table("bl_customer as cust")
                    ->join('bl_user_profile_defn as user','user.user_id','=','cust.customer_id')
                    ->join('bl_address as address','cust.customer_id','=','address.user_id')
                    ->where([['cust.is_deleted',0],['address.add_type_id',2],['user.user_type','C']])
                    ->where('cust.customer_id','=',$user_id)
                    ->select('cust.cust_first_name','cust.cust_last_name','cust.customer_id')
                    ->get();
---
select `cust`.`cust_first_name`, `cust`.`cust_last_name`, `cust`.`customer_id` from `bl_customer` as `cust` inner join `bl_user_profile_defn` as `user` on `user`.`user_id` = `cust`.`customer_id` inner join `bl_address` as `address` on `cust`.`customer_id` = `address`.`user_id` where (`cust`.`is_deleted` = '0' and `address`.`add_type_id` = '2' and `user`.`user_type` = 'C') and `cust`.`customer_id` = '1'

                $invoiceHeader['total_invoice_qty'] = '1';
                $invoiceHeader['created_by_user_id'] = $user_profile_id;
                $invoiceHeader['last_update_user_id'] = $user_profile_id;
                $invoiceHeader->save();
---
insert into `bl_invoice_header` (`invoice_no`, `order_date`, `consignee_first_name`, `consignee_last_name`, `cust_id`, `clnt_id`, `order_no`, `type`, `cust_tax_ref_no`, `total_bill_amt`, `currency`, `other_ref`, `pay_mode`, `signature_title`, `name_of_authority`, `sales_terms1`, `sales_terms2`, `sales_terms3`, `sales_terms4`, `sales_terms5`, `total_invoice_qty`, `created_by_user_id`, `last_update_user_id`) values ('BLINV20180524180200', '', 'Sureshbabu', 'Kaliyaperumal', '1', '', 'BLODR20180524180200', '1', '1', '659.60', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '1', '47', '47')

                $invoiceDetail['exam_attempt_type_id'] = $data[$y]['exam_attempt_type_id'];
                $invoiceDetail['created_by_user_id'] = $user_profile_id;
                $invoiceDetail['last_update_user_id'] = $user_profile_id;
                $invoiceDetail->save();
            }
              $test1 = DB::table('bl_shopping_cart_master')
                                ->where('user_profile_id', '=',$user_profile_id )
                                ->delete();
---
insert into `bl_invoice_detail` (`invoice_code`, `invoice_date`, `seq_no`, `exam_code`, `exam_name`, `price`, `discount_amount`, `sgst`, `cgst`, `igst`, `other_tax1`, `other_tax2`, `other_tax3`, `bundle_price`, `total_amount`, `total_qty`, `total_tax_amount`, `total_bill_value`, `unit_qty`, `sales_terms1`, `sales_terms2`, `sales_terms3`, `sales_terms4`, `sales_terms5`, `exam_attempt_type_id`, `created_by_user_id`, `last_update_user_id`) values ('BLINV20180524180200', '', '1', 'BLPRO20180524123830', 'my full description', '250.00', '1', '7.00', '5.00', '7.00', '5.00', '5.00', '7.00', '1', '659.60', '2', '174.60', '659.60', '2', '1', '1', '1', '1', '1', '1', '47', '47')
delete from `bl_shopping_cart_master` where `user_profile_id` = '47'

    public function delete(array $data, $user_profile_id){
     try{

          //  DB::beginTransaction();

            $cart = DB::table('bl_shopping_cart_detail')->where([["product_catalog_id",'=', $data[0]],['user_profile_id','=',$user_profile_id]])->delete();

            $product = DB::table('bl_shopping_cart_detail as shop')
                ->where('shop.user_profile_id', '=', $user_profile_id)
                ->select('shop.*')
                ->get();
            if(count($product) == 0){
               $cart = DB::table('bl_shopping_cart_master')->where('user_profile_id','=',$user_profile_id)->delete();
---
delete from `bl_shopping_cart_detail` where (`product_catalog_id` = '4' and `user_profile_id` = '47')
select `shop`.* from `bl_shopping_cart_detail` as `shop` where `shop`.`user_profile_id` = '47'
delete from `bl_shopping_cart_master` where `user_profile_id` = '47'

    public function getPromoCode(array $data, $user_profile_id, $user_type, $user_id)
    {
         try {

            DB::beginTransaction();
             if($user_type == 'C'){
                $orderCode = DB::table("bl_order_detail as ordD")
                ->where('ordD.order_master_id', '=', $data['id'])
                ->join('bl_order_master as ordM', 'ordM.id', '=', 'ordD.order_master_id')
                ->join('bl_product_catalog as proD','proD.id','=','ordD.product_catalog_id')
                ->select('ordM.order_no','ordM.order_date','ordD.id as orDid','ordD.unit_qty','proD.product_catalog_code','proD.name','proD.valid_from','proD.valid_to','proD.id as proId','ordD.no_of_attempts')
                ->get();
                $tmp = json_decode($orderCode,true);
                for ($y = 0; $y < count($tmp); $y++){
                    $qty = $tmp[$y]['unit_qty'];
                    $int = (int)$qty;
                    for($x = 0; $x < $int; $x++){
                        $promoMaster = new PromoMaster;
                              $promoCode = DB::table("bl_promo_master as proM")
                              ->orderBy('id', 'desc')
                                ->select('proM.promo_code')
                                ->get();
---
select `ordM`.`order_no`, `ordM`.`order_date`, `ordD`.`id` as `orDid`, `ordD`.`unit_qty`, `proD`.`product_catalog_code`, `proD`.`name`, `proD`.`valid_from`, `proD`.`valid_to`, `proD`.`id` as `proId`, `ordD`.`no_of_attempts` from `bl_order_detail` as `ordD` inner join `bl_order_master` as `ordM` on `ordM`.`id` = `ordD`.`order_master_id` inner join `bl_product_catalog` as `proD` on `proD`.`id` = `ordD`.`product_catalog_id` where `ordD`.`order_master_id` = '34'
select `proM`.`promo_code` from `bl_promo_master` as `proM` order by `id` desc

                        $promoMaster['created_by_user_id'] = $user_profile_id;
                        $promoMaster['last_update_user_id'] = $user_profile_id;
                        $promoMaster['order_detail_id'] = $tmp[$y]['orDid'];
                        $promoMaster->save();
---
insert into `bl_promo_master` (`promo_code`, `client_id`, `exam_code`, `exam_name`, `product_catalog_id`, `promo_valid_fm_date`, `promo_valid_to_date`, `payment_ref_no`, `order_no`, `order_date`, `no_attempts_sofar`, `no_attempts_allowed`, `user_profile_id`, `created_by_user_id`, `last_update_user_id`, `order_detail_id`) values ('CU20180524000004', '', 'BLPRO20180524123830', 'my full description', '4', '2018-02-15 00:00:00', '2018-05-30 00:00:00', '1', 'BLODR20180524183259', '2018-05-24 18:32:59', '0', '99999999999', '47', '47', '47', '22')

      public function getAllShopCart(){

          try{
                $currentdate =new Carbon();
                // $sql = 'proc.valid_from' >= $currentdate or 'proc.valid_to' >= $currentdate;
                $product = DB::table("bl_product_catalog as proc")
               //->where([['proc.is_deleted',0],['proc.is_active',1],['proc.populate_all',1]])
                //->where(function($q) {
                   // $currentdate =new Carbon();
                   // $q->where([['proc.is_deleted',0],['proc.is_active',1],['proc.populate_all',1],['proc.valid_from', '<=' , $currentdate],['proc.valid_to', '>=' , $currentdate]]);
               // })
                ->join('bl_category as cat','proc.category_id','=','cat.category_id')
                ->join('bl_subject as sub','proc.subject_id','=','sub.subject_id')
                ->join('bl_topic as top','proc.topic_id','=','top.topic_id')
                // ->join('bl_product_catalog_attempt_type_link as prod_link','prod_link.product_catalog_id','=','proc.id')
                ->join('bl_exam_attempt_type as exam','exam.id', '=', 'proc.exam_attempt_type_id')
                ->select('proc.*','cat.category_name','cat.category_id','sub.subject_id','top.topic_id','sub.subject_name','top.topic_name','exam.name as examName')
                ->simplePaginate(self::$RECORDS_PER_PAGE);
---
select `proc`.*, `cat`.`category_name`, `cat`.`category_id`, `sub`.`subject_id`, `top`.`topic_id`, `sub`.`subject_name`, `top`.`topic_name`, `exam`.`name` as `examName` from `bl_product_catalog` as `proc` inner join `bl_category` as `cat` on `proc`.`category_id` = `cat`.`category_id` inner join `bl_subject` as `sub` on `proc`.`subject_id` = `sub`.`subject_id` inner join `bl_topic` as `top` on `proc`.`topic_id` = `top`.`topic_id` inner join `bl_exam_attempt_type` as `exam` on `exam`.`id` = `proc`.`exam_attempt_type_id` limit 6 offset 0

    public function getCartCount($user_profile_id){
        try{


                $product = DB::table('bl_shopping_cart_detail as shop')
                ->where('shop.user_profile_id', '=', $user_profile_id)
                ->select('shop.*')
                ->get();
---
select `shop`.* from `bl_shopping_cart_detail` as `shop` where `shop`.`user_profile_id` = '47'

    public function getCustExam2($user_profile_id){

        try{

               // $exams = DB::table('bl_order_detail as bod')
               //           ->join('bl_product_catalog as proc', 'bod.product_catalog_id','=','proc.id')
               //           ->join('bl_order_master as bom', 'bod.order_master_id','=','bom.id')
               //           ->join('bl_exam_schedule as es','bod.id','=','es.order_detail_id','left outer')
               //          ->join('bl_promo_master as proM','proc.id','=','proM.product_catalog_id')
               //           ->select('bod.id','proc.name as exam_name','proc.description','es.is_schedule')
               //           ->get();

            $promo = DB::table('bl_promo_master as proM')
                        ->join('bl_exam_schedule as exsc','proM.id','=','exsc.promo_master_id','left outer')
                        ->join('bl_product_catalog as prod', 'proM.product_catalog_id','=','prod.id','left outer')
                        ->leftjoin('bl_exam_attempt_type as extyp', 'extyp.id','=','prod.exam_attempt_type_id')
                        ->ORwhere([['proM.user_profile_id','=',$user_profile_id],
                            ['exsc.status','=','completed']])
                        ->ORwhere([['proM.exam_allocated_to','=',$user_profile_id],
                            ['exsc.status','=','completed']])
                        ->select('exsc.status','exsc.is_schedule','exsc.start_time','exsc.end_time','exsc.exam_planned_date','proM.promo_code','prod.valid_days','proM.order_detail_id','proM.id','prod.name','extyp.name as exname','proM.no_attempts_sofar','proM.no_attempts_allowed as no_of_attempts','exsc.exam_schedule_id')
                        ->get();
            $tmp = json_decode($promo,true);
            $order = DB::table('bl_order_detail as bod')
                        ->join('bl_exam_schedule as exsc','bod.id','=','exsc.order_detail_id','left outer')
                        ->join('bl_product_catalog as prod', 'bod.product_catalog_id','=','prod.id','left outer')
                        ->leftjoin('bl_exam_attempt_type as extyp', 'extyp.id','=','prod.exam_attempt_type_id')
                        ->where('bod.user_profile_id','=',$user_profile_id)
                        ->where('exsc.status','=','completed')
                        ->select('exsc.status','exsc.is_schedule','exsc.start_time','exsc.end_time','exsc.exam_planned_date','bod.id' ,'bod.id as order_detail_id','prod.valid_days','prod.name','extyp.name as exname','bod.no_of_attempts','exsc.exam_schedule_id','bod.no_attempts_sofar')
                        ->get();
---
select `exsc`.`status`, `exsc`.`is_schedule`, `exsc`.`start_time`, `exsc`.`end_time`, `exsc`.`exam_planned_date`, `proM`.`promo_code`, `prod`.`valid_days`, `proM`.`order_detail_id`, `proM`.`id`, `prod`.`name`, `extyp`.`name` as `exname`, `proM`.`no_attempts_sofar`, `proM`.`no_attempts_allowed` as `no_of_attempts`, `exsc`.`exam_schedule_id` from `bl_promo_master` as `proM` left outer join `bl_exam_schedule` as `exsc` on `proM`.`id` = `exsc`.`promo_master_id` left outer join `bl_product_catalog` as `prod` on `proM`.`product_catalog_id` = `prod`.`id` left join `bl_exam_attempt_type` as `extyp` on `extyp`.`id` = `prod`.`exam_attempt_type_id` where (`proM`.`user_profile_id` = '47' and `exsc`.`status` = 'completed') or (`proM`.`exam_allocated_to` = '47' and `exsc`.`status` = 'completed')
select `exsc`.`status`, `exsc`.`is_schedule`, `exsc`.`start_time`, `exsc`.`end_time`, `exsc`.`exam_planned_date`, `bod`.`id`, `bod`.`id` as `order_detail_id`, `prod`.`valid_days`, `prod`.`name`, `extyp`.`name` as `exname`, `bod`.`no_of_attempts`, `exsc`.`exam_schedule_id`, `bod`.`no_attempts_sofar` from `bl_order_detail` as `bod` left outer join `bl_exam_schedule` as `exsc` on `bod`.`id` = `exsc`.`order_detail_id` left outer join `bl_product_catalog` as `prod` on `bod`.`product_catalog_id` = `prod`.`id` left join `bl_exam_attempt_type` as `extyp` on `extyp`.`id` = `prod`.`exam_attempt_type_id` where `bod`.`user_profile_id` = '47' and `exsc`.`status` = 'completed'