app/Repositories/SubjectRepository.php

    public function getcol(){
       try{
           //$category = Category::all();
           $subject = Subject::where([['is_deleted',0],['is_active',1]])->get();
---
select * from `bl_subject` where (`is_deleted` = '0' and `is_active` = '1')